{
    "Goals": {
        "Keto": "Low-carb, high-fat diet that can help you burn fat more effectively. It involves drastically reducing carbohydrate intake and replacing it with fat. This reduction in carbs puts your body into a metabolic state called ketosis. When this happens, your body becomes incredibly efficient at burning fat for energy.",
        "Vegetarian":
            "Excludes meat, seafood, and poultry, but allows other foods. It can be effective for weight loss and certain health conditions.",
        "Low Carb":
            "Reduce the intake of carbohydrates to create a calorie deficit.",
        "Muscle Gain":
            "Involves eating more calories than the body burns, with a focus on protein. This diet should be combined with resistance or strength training exercises.",
    },
    "Dietary Requirements": {
        "Halal": "Consumption of food that adheres to Islamic dietary laws.",
        "High Cholesterol":
            "Condition where there is too much cholesterol in your blood. Cholesterol is a type of fat that is essential for many bodily functions, but too much of it can stick to the walls of your arteries and narrow them, which can lead to heart disease.",
        "Hypertension":
            "Also known as high blood pressure, is a condition where the force of the blood against the artery walls is too high. It can lead to severe health complications such as heart disease and stroke.",
        "Hypoglycaemia":
            "Also known as Low blood sugar, is a condition resulting when the blood glucose levels drop below the specified limits (4 mmol/L or 72mg/dL). It causes irregular or rapid heartbeat, pale skin, numbness of lips, tongue or cheek, and sweating.",
        "Bloating":
            "A feeling of tightness, pressure, or fullness in your belly, often caused by excess gas. It can make your stomach appear larger and clothes feel tighter. Bloating may be caused by how and what you eat, abnormal reactions to food, or certain medical conditions.",
        "Obesity":
            "Obesity is a long-term health condition characterized by excess body fat, commonly measured by BMI.",
        "Iron Deficiency Anaemia":
            "Condition where a lack of iron in the body leads to a reduction in the number of red blood cells. Iron is used to produce red blood cells, which help store and carry oxygen in the blood.",
        "Irritable Bowel Syndrome (IBS)":
            "Common disorder that affects the stomach and intestines, also called the gastrointestinal tract. Symptoms include cramping, abdominal pain, bloating, gas, and diarrhea or constipation, or both.",
        "No Soy": "",
        "No Lactose": "",
        "No Gluten": "",
        "No Nuts": "",
        "No Seafood": "",
        "No Allium": "",
        "No Sesame": ""
    }
}